---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.IsLayoutChanged
source: html/e899e410-1146-0999-bcf7-9c2654edf8cd.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.IsLayoutChanged Property

Indicates if the layout has changed since the last regeneration.

## Syntax (C#)
```csharp
public bool IsLayoutChanged { get; }
```